<template>
    <div class="app">
        <p v-if="picked" class="title"><strong>Выбрана категория : {{ picked }}</strong></p>
        <div v-for="category in categories" class="content">
            <div v-if="picked === category.name" v-for="(info, infoIndex) in category.infos" :key="infoIndex" class="card">
            <img :src="require(`@/assets/${info.src}`)" :alt="info.alt">
            <div class="info">
                <details >
                    <summary>{{ info.name }}</summary>
                    <span>{{ info.text }}</span>
                </details>
            </div>
            </div>
        </div>
        <p class="choose"><strong>Выберите категорию божественных существ:</strong></p>
        <div class="list">
            <label v-for="(title, index) in titles" :key="index">
                <input  type="radio" v-model="picked" :value="title"> {{ title }}
            </label>
        </div>
    </div>
</template>
    
<script>
export default {
    data() {
        return {
            titles: [
                "Древние", "Внешние боги", "Старшие боги", "Небожественные существа"
            ],
            picked: '' ,
            categories: [
            {
                name: "Древние",
                infos: [
                    { src: 'img1.jpg', alt: "Ктулху (Cthulhu)", name: "Ктулху (Cthulhu)", text:"Ктхугха (Cthugha) — создан Августом Дерлетом и впервые появляется в рассказе «Дом на кривой улице» (1962). Это существо выглядит как огромный шар огня. Его слуги — раса огненных вампиров. В рассказе Дерлета «Обитающий во тьме» главный герой пытается призвать Ктхугху, чтобы тот изгнал воплощение Ньярлатхотепа (Nyarlathotep) из леса в Канаде." },
                    { src: 'img2.jpg', alt: "Дагон (Dagon)",name: "Дагон (Dagon)", text:"Дагон (Dagon) — еще одна «суперзвезда» мифов Ктулху. В реальности Дагон был божеством зерна и земледелия (dagan, иуд. — зерно), почитаемым северо-западными семитскими племенами. Упоминания о нем встречаются даже в Библии — например, в пятой главе первой книги Царств." },
                    { src: 'img3.jpg', alt: "Хастур (Hastur)",name: "Хастур (Hastur)", text:"Хастур (Hastur) — Непроизносимый; Тот, кого нельзя называть. Лавкрафт позаимствовал его у Амброза Бирса (рассказ «Пастух Гаита»), где Хастур был покровителем пастухов — сугубо доброй сущностью, в отличие от той злобной твари, которая появилась на страницах рассказа Лавкрафта «Шепоты во мраке»." },
                ],
                
            },
            {
                name: "Внешние боги",
                infos: [
                    { src: "img4.jpg", alt: "Азатот (Azathoth)" ,name: "Азатот (Azathoth)", text:"Азатот (Azathoth) — Султан демонов, Кипящий ядерный хаос. Этот бог стоит во главе пантеона мифов Ктулху. Лавкрафт подробно описывает его в романе «Сомнамбулический поиск неведомого Кадата», повестях «Сны в ведьмином доме» и «Шепчущий в ночи». Если верить автору, Азатот — слепой бог-идиот, не имеющий конкретной физической формы (хотя он может воплощаться в существо Xada-Ngla)." },
                    { src: "img5.jpg", alt: "Ньярлатхотеп (Nyarlathotep)" ,name: "Ньярлатхотеп (Nyarlathotep)", text:"Ньярлатхотеп (Nyarlathotep) — Ползучий хаос, Посланец Азатота, Черный человек. Это божество очень сильно отличается от своих собратьев. В отличие от Хастура, живущего на звездах, или Ктулху, спящего в морской глубине, Ньярлатхотеп полон жизни и активно вмешивается в судьбу мироздания. Его излюбленная внешность — высокий человек с темными волосами и хорошим чувством юмора. Он говорит на обычном человеческом языке, не имеет своего культа и служит посланником Азатота, реализуя его волю на Земле." },
                    { src: "img6.jpg", alt: "Шаб-Ниггурат (Shub-Niggurath)" ,name: "Шаб-Ниггурат (Shub-Niggurath)", text:"Шаб-Ниггурат (Shub-Niggurath) — Черный козел из лесов с тысячью молодых. Как таковое, это чудовище в романах Лавкрафта не встречалось, однако его имя можно было встретить в нескольких заклинаниях (Ia! Shub-Niggurath) — см. «Шепоты во мраке», «Сны в ведьмином доме», «Кошмар в музее». Внешне это существо выглядит как огромная бесформенная масса, усеянная щупальцами, слюнявыми ртами — и все это передвигается на кривых козлиных ногах."},
                ],
               
            },
            {
                name: "Старшие боги",
                infos: [
                    { src: 'img7.jpg', alt: "Баст (Bast)",name: "Баст (Bast)", text:"Баст (Bast), или Бастет — божество, заимствованное у египтян. Традиционно связывается с солнцем, плодородием и благополучными родами у женщин. Баст имеет два воплощения — женщина с кошачьей головой (добрая сущность) и львиной (агрессивная). Считается, что, находясь во второй форме, Баст превращается в Секхмет — львицу, которая однажды едва не уничтожила все человечество. Ее удалось усмирить лишь с помощью хитрости — по земле было разлито пиво, подкрашенное минеральными красителями в красный цвет. Львица приняла эту жидкость за кровь, напилась и уснула." },
                    { src: 'img8.jpg', alt: "Эндимион",name: "Эндимион", text:"Эндимион — молодой пастух, влюбился в богиню луны Селену и получил от Гипноса редкий дар — способность спать с открытыми глазами, чтобы даже во сне он мог смотреть на свою любимую." },
                    { src: 'img9.jpg', alt: "Ноденс (Nodens)",name: "Ноденс (Nodens)", text:"Ноденс (Nodens) — Охотник, Повелитель Великой бездны. Как уже было сказано ранее, впервые он появился в рассказе Лавкрафта «Дом на туманном утесе». Представляет из себя пожилого мужчину с длинной густой бородой и седыми волосами. Ноденс путешествует по миру в колеснице, сделанной из огромной морской ракушки. Его призвание — охота, причем в качестве жертв он чаще всего выбирает себе существ, принадлежащих к пантеону Древних. Это вовсе не говорит о том, что Ноденс — защитник добра. Просто злые чудовища представляют для него наиболее сложную, а, следовательно, — привлекательную добычу." },
                ],
                
            },
            {
                name: "Небожественные существа",
                infos: [
                    { src: 'img10.jpg', alt: "Подземные (Chtonians)",name: "Подземные (Chtonians)", text:"Подземные (Chtonians) — милые зверюшки, напоминающие крупных кальмаров и отличающиеся от них удлиненными телами, покрытыми скользкой слизью (эта морфологическая особенность позволяет им легко перемещаться под землей). О Подземных известно, что они живут тысячи лет, ревностно охраняют свое потомство от людей и издают тягучие печальные звуки, по которым легко определить их приближение. Подробнее об этих тварях можно узнать из сборника рассказов Брайана Ламли «Из глубины» (1974)."},
                    { src: 'img11.jpg', alt: "Глубоководные (Deep Ones)" ,name: "Глубоководные (Deep Ones)", text:"Глубоководные (Deep Ones) — рыбо-лягушкоподобные существа, обитающие глубоко в океане. Будучи амфибиями, они неплохо чувствуют себя на суше и иногда выходят к людям. В обмен на человеческие жертвы Глубоководные могут дарить золото, украшения и наполнять сети рыбой."},
                    { src: 'img12.jpg', alt: "Старцы (Elder Things)" ,name: "Старцы (Elder Things", text:"Старцы (Elder Things) — инопланетяне, населявшие Землю до людей. Представляли собой помесь растения и животного. Старцы строили гигантские города на земле и под водой, воевали с богами (без особого успеха) и, вероятно, произвели на свет тех существ, которые населяют планету и по сей день. Цивилизация Старцев погибла в ледниковый период, их замерзший город в Антарктиде был обнаружен лишь в 1931 году (роман Лавкрафта «Хребты безумия»)."},
                ],
                
            },
            ]
        };
    }
};
</script>

<style lang="scss" scoped>
.app::before {
    content: "";
    position: absolute;
    top: 0;
    left: 0;
    width: 100%;
    height: 100%;
    background-image: url("@/assets/backgroud.jpg");
    background-attachment: fixed;
    background-repeat: no-repeat;
    background-size: cover;
    opacity: 0.9; 
    z-index: -2; 
}


.app {
    color: #0b2038;
    position: absolute; 
    top: 0;
    right: 0;
    min-width: 100vw;
    min-height: 100vh;
    font-size: 16pt;
    z-index: -1;
    .title{
        display: flex;
        justify-content: center;
        background-color: #4956ad62;
        padding: 20px 0px;
        margin-top: 70px;
    }
    .list {
        display: flex;
        flex-direction: column;
        padding: 10px 5px 5px 0px;
        box-shadow: 10px 4px 10px 3px #4957AD;
        font-size: 18pt;
    }

    label {
        width: 300px;
        align-self: center;
    }
    .choose{
        display: flex;
        justify-content: center;
        text-align: center;
        background-color: #6878e088;
        padding: 20px 0px;
        box-shadow: 10px 3px 10px 4px #4957AD;
        margin-top: 70px;
        
    }
    .content{
        display: flex;
        flex-direction: row;
        flex-wrap: wrap;
        width: 100vw;
        justify-content: space-around;
       
        .card{
            margin-top: 20px;
            display: flex;
            flex-direction: column;
            align-items: center;
            width: clamp(350px,33vw,600px);
        }
        .info{
            display: flex;
            justify-content: center;
            details{

                width: 300px;
                margin-left: -4vw;
                font-size: 18pt;
                margin-bottom: 30px;
                
                span,summary{
                    color:#000000
                }
            }
        }
        img{
            object-fit: cover;
            width: 300px;
            height: 400px;
            box-shadow: 40px 29px 40px 60px #4956adc5,
                    -100px 10px 50px 20px  #7e49adaa;
        }
    }  
}
</style>